app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"   ORDER BY manufacturer, model
---
	def index
		respond_with Car.order("manufacturer, model")

SELECT  "cars".* FROM "cars"  WHERE "cars"."plate" = 'NZC7079' LIMIT 1
---
	def show
		respond_with Car.find_by_plate(params[:id])

INSERT INTO "cars" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-04-23 22:56:52.240195"], ["updated_at", "2014-04-23 22:56:52.240195"]]
---
	def create
		respond_with Car.create(car_params)